# 🎩✨ Pablo's Ultimate Mary Poppins Terminal Magic Box ✨🎩
# Generated on: 2025-06-06
# Rating: 11/10 - Because normal terminals are boring!

# =============================================================================
# 🚀 TERMINAL SUPERPOWERS
# =============================================================================

# Core Shell Tools (The Foundation of Magic)
brew "bash"                # Bourne-Again SHell, updated version
brew "zsh"                 # Z shell - your magical canvas
brew "tmux"                # Terminal multiplexer - multiple magic windows!
brew "starship"            # The prettiest prompt in the galaxy
brew "direnv"              # Per-directory environment magic

# Modern CLI Replacements (Everything But Better)
brew "bat"                 # Cat with syntax highlighting and git integration
brew "eza"                 # ls on steroids with icons and git status
brew "fd"                  # Find files at the speed of light
brew "ripgrep"             # Grep so fast it'll make your head spin
brew "zoxide"              # cd that learns where you want to go
brew "broot"               # Navigate directories like a tree wizard
brew "duf"                 # Disk usage that actually looks good
brew "dust"                # du but intuitive and pretty
brew "procs"               # ps with modern features and colors
brew "glow"                # Markdown that glows in your terminal
brew "delta"               # Git diffs that are actually beautiful

# File Management Magic
brew "ranger"              # Vi-style file manager with preview
brew "nnn"                 # Blazingly fast file manager
brew "fselect"             # Query files with SQL syntax!
brew "trash"               # Safe rm - moves to trash instead
brew "rename"              # Batch rename with regex power
brew "dua-cli"             # Interactive disk usage analyzer
brew "tag"                 # macOS file tagging from terminal

# Network & System Tools
brew "wget"                # Classic file downloader
brew "httpie"              # HTTP requests for humans
brew "mtr"                 # Traceroute + ping had a beautiful baby
brew "speedtest-cli"       # Test your internet speed
brew "tree"                # ASCII directory trees
brew "htop"                # System monitor with style
brew "btop"                # Even prettier system monitor
brew "tldr"                # Man pages for humans
brew "thefuck"             # Fix your command typos with style

# Terminal Productivity
brew "fzf"                 # Fuzzy finder - find anything instantly
brew "gum"                 # Build beautiful shell scripts
brew "micro"               # Modern text editor for mortals
brew "hexyl"               # Hex viewer with colors
brew "hyperfine"           # Benchmark your commands
brew "tokei"               # Count your code in style

# =============================================================================
# 🎨 TERMINAL AESTHETICS & FUN
# =============================================================================

# ASCII Art Extravaganza
brew "figlet"              # Big ASCII text banners
brew "toilet"              # Colorful ASCII text with fonts
brew "cowsay"              # Cows that speak wisdom
brew "ponysay"             # My Little Pony meets cowsay
brew "fortune"             # Random quotes and jokes
brew "lolcat"              # Rainbowify EVERYTHING
brew "cmatrix"             # Matrix rain animation
brew "asciiquarium"        # Fish tank in your terminal!
brew "sl"                  # Train that punishes your typos
brew "pipes-sh"            # Animated pipes screensaver
brew "bb"                  # Mind-blowing ASCII art demo
brew "no-more-secrets"     # Text decryption effect from Sneakers movie

# Terminal Bling
brew "neofetch"            # System info with ASCII logos
brew "pfetch"              # Minimal pretty system info
brew "cava"                # Audio visualizer that dances
brew "tty-clock"           # Digital clock for your terminal
brew "termsaver"           # Multiple terminal screensavers
brew "toilet"              # Colorful ASCII text generator

# Neko and Friends
brew "neko"                # The classic cat chasing your cursor!
# Note: oneko would be a cat that follows your mouse on the desktop (requires X11)
# Since you asked - neko is the terminal version, oneko is the GUI version

# =============================================================================
# 🎯 DEVELOPMENT TOOLS
# =============================================================================

# Version Control Magic
brew "git"                 # The one and only
brew "git-delta"           # Beautiful git diffs
brew "gh"                  # GitHub in your terminal
brew "lazygit"             # Git UI that's actually intuitive
brew "tig"                 # Text-mode interface for git
brew "act"                 # Run GitHub Actions locally

# Build Tools
brew "cmake"               # Cross-platform build system
brew "automake"            # Makefile generator
brew "libtool"             # Library tools
brew "pkgconf"             # Compiler/linker flags
brew "nasm"                # Assembler for x86
brew "yasm"                # Yet another assembler

# Languages & Runtimes
brew "python@3.12"         # Python for all the things
brew "node"                # JavaScript everywhere
brew "nvm"                 # Node version management

# Data Wrangling
brew "jq"                  # JSON processor extraordinaire
brew "yq"                  # YAML/XML processor
brew "miller"              # CSV/JSON/more processing

# =============================================================================
# 🖼️ IMAGE & MEDIA MAGIC
# =============================================================================

# Image Processing Suite
brew "imagemagick"         # The Swiss Army knife of images
brew "vips"                # Lightning fast image processing
brew "graphicsmagick"      # ImageMagick alternative
brew "librsvg"             # SVG rendering
brew "gmic"                # Hundreds of image filters
brew "ghostscript"         # PDF/PostScript magic

# Image Optimization
brew "imageoptim-cli"      # Shrink images without quality loss
brew "jpegoptim"           # JPEG compression wizard
brew "pngquant"            # PNG compression magic
brew "optipng"             # More PNG optimization
brew "gifski"              # High-quality GIF encoder
brew "gifsicle"            # GIF manipulation tool

# Metadata & Info
brew "exiftool"            # Read/write image metadata
brew "exiv2"               # More metadata magic
brew "mediainfo"           # Media file information

# Audio/Video Powerhouse
brew "ffmpeg"              # Transcode anything to anything
brew "sox"                 # Audio Swiss Army knife
brew "eye-d3"              # MP3 tag editor
brew "vapoursynth"         # Advanced video processing
brew "opencv"              # Computer vision library
brew "portaudio"           # Audio I/O library

# Required Media Dependencies
brew "flac"                # Lossless audio
brew "lame"                # MP3 encoder
brew "libvorbis"           # Ogg Vorbis
brew "x264"                # H.264 encoder
brew "libass"              # Subtitles
brew "frei0r"              # Video effects
brew "libsoxr"             # Sample rate conversion
brew "libvidstab"          # Video stabilization

# =============================================================================
# 🔐 SECURITY & PRIVACY
# =============================================================================

brew "gnupg"               # Encryption and signing
brew "pass"                # Unix password manager
brew "mas"                 # Mac App Store CLI

# =============================================================================
# 🛠️ UTILITIES & HELPERS
# =============================================================================

brew "duti"                # Set default apps
brew "tesseract"           # OCR text from images
brew "wakeonlan"           # Wake up computers
brew "watch"               # Execute commands periodically
brew "pv"                  # Progress bars for pipes

# =============================================================================
# 💻 MACOS GUI APPS (The Non-Terminal Magic)
# =============================================================================

# Productivity
cask "betterzip"           # Archive management
cask "alfred"              # Launcher on steroids (optional)
cask "rocket"              # Emoji picker 🚀

# Development
cask "sublime-text"        # Text editor
cask "warp"                # AI-powered terminal
cask "github"              # GitHub Desktop

# System Enhancement
cask "bluesnooze"          # Bluetooth sleep manager
cask "dockdoor"            # Dock window previews
cask "notunes"             # Stop iTunes from launching

# Media
cask "iina"                # Beautiful video player
cask "kodi"                # Media center (optional)

# Communication
cask "halloy"              # IRC client for the modern age

# Gaming
cask "flycast"             # Dreamcast emulator

# QuickLook Magic (Preview Everything!)
cask "qlcolorcode"         # Source code with syntax highlighting
cask "qlmarkdown"          # Markdown files
cask "qlstephen"           # Plain text files
cask "quicklook-csv"       # CSV files
cask "quicklook-json"      # JSON files
cask "webpquicklook"       # WebP images
cask "suspicious-package"  # Mac packages
cask "qlimagesize"         # Image dimensions in title bar
cask "qlvideo"             # More video formats
cask "qlprettypatch"       # Patch/diff files

# Fonts (Because Code Deserves Beauty)
cask "font-fira-code-nerd-font"          # Ligatures + icons
cask "font-jetbrains-mono-nerd-font"     # Alternative beauty
cask "font-cascadia-code-nerd-font"      # Microsoft's gift
cask "font-hack-nerd-font"               # Classic hacker font

# =============================================================================
# 🎮 VS CODE EXTENSIONS (Your Code Editor Magic)
# =============================================================================

# Themes & Beauty
vscode "akamud.vscode-theme-onedark"
vscode "vscode-icons-team.vscode-icons"
vscode "oderwat.indent-rainbow"
vscode "naumovs.color-highlight"          # Highlight colors in code

# Git Power
vscode "eamodio.gitlens"
vscode "donjayamanne.githistory"
vscode "github.vscode-pull-request-github"
vscode "felipecaputo.git-project-manager"   # Quick project switching

# AI Assistance
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "doublebot.doublebot"              # Another AI assistant

# Core Development
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.debugpy"                # Python debugging
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"

# Language Support
vscode "svelte.svelte-vscode"             # Svelte framework
vscode "denoland.vscode-deno"             # Deno runtime
vscode "mads-hartmann.bash-ide-vscode"    # Bash scripting
vscode "timonwong.shellcheck"             # Shell script analysis

# Productivity Boosters
vscode "wayou.vscode-todo-highlight"
vscode "streetsidesoftware.code-spell-checker"
vscode "ms-azuretools.vscode-docker"
vscode "rangav.vscode-thunder-client"
vscode "quicktype.quicktype"              # Generate types from JSON
vscode "shardulm94.trailing-spaces"       # Highlight trailing spaces
vscode "chakrounanas.turbo-console-log"   # Quick console.log insertion
vscode "benjpas.close-all"                # Close all editors
vscode "denjay.fold-level"                # Code folding control

# Web Development
vscode "bradlc.vscode-tailwindcss"
vscode "formulahendry.auto-rename-tag"
vscode "heybourn.headwind"                # Sort Tailwind classes
vscode "firefox-devtools.vscode-firefox-debug"  # Firefox debugging

# Code Snippets
vscode "xabikos.javascriptsnippets"       # JavaScript snippets
vscode "ericsia.pythonsnippets3"          # Python snippets

# File Support
vscode "shd101wyy.markdown-preview-enhanced"
vscode "mechatroner.rainbow-csv"          # CSV with colors!

# =============================================================================
# 🎭 BONUS PABLO SPECIALS
# =============================================================================

# Extra Terminal Customization
brew "vivid"               # LS_COLORS generator
brew "exa"                 # Another ls replacement (yes, both!)
brew "genact"              # Fake Hollywood-style activity
brew "hollywood"           # Pretend you're hacking like in movies

# More Fun
brew "spark"               # Sparklines in your terminal
brew "grc"                 # Colorize command output
brew "colordiff"           # Colorful diffs

# Dependencies & Libraries
brew "libcaca"             # ASCII art library (dependency for some tools)
brew "ccat"                # Colorized cat (yes, we want both cat tools!)

# =============================================================================
# 🚀 POST-INSTALL SETUP COMMANDS
# =============================================================================

# After running `brew bundle`, execute these:
#
# 1. Set up your shell (add to ~/.zshrc):
#    eval "$(starship init zsh)"
#    eval "$(thefuck --alias)"
#    eval "$(zoxide init zsh)"
#    eval "$(direnv hook zsh)"
#
# 2. Install fzf key bindings:
#    $(brew --prefix)/opt/fzf/install
#
# 3. Set up vivid for colored ls:
#    export LS_COLORS="$(vivid generate molokai)"
#
# 4. Try these commands for instant fun:
#    - `cmatrix` - Matrix rain
#    - `asciiquarium` - Fish tank
#    - `fortune | cowsay | lolcat` - Rainbow cow wisdom
#    - `figlet "PABLO ROCKS" | lolcat` - Rainbow banner
#    - `neofetch` - Show off your system
#    - `sl` - Choo choo!
#    - `genact` - Look like a movie hacker
#
# Welcome to your magical terminal, Pablo! 🎩✨